Tekla Open API Reference for Tekla Structures 2025
AutoDrawingRule Properties
The AutoDrawingRule type exposes the following members.
Properties
Name | Description
Filename
 The filename of the AutoDrawing script.
Top
See Also
Reference
AutoDrawingRule Class
Tekla.Structures.Drawing.Automation Namespace